<template>
    <div class="app">
        <h1>Страница с постами</h1>
        <my-button
        @click="showDialog">Добавить пост</my-button>
        <my-dialog v-model:show="dialogVisible">
            <post-form @create="createPost">

            </post-form>
        </my-dialog>
        
        <post-list v-bind:posts="posts" @remove="removePost">

        </post-list>
    </div>
</template>

<script>
import PostForm from "@/components/PostForm.vue";
import PostList from "@/components/PostList.vue";
export default {
    components: {
        PostForm, PostList,
    },
    data() {
        return {
            posts: [
                { id: 1, title: 'Название 1', body: 'Не следует, однако, забывать о том, что постоянное информационно-техническое обеспечение нашей деятельности обеспечивает широкому кругу специалистов участие в формировании экономической целесообразности принимаемых решений! Таким образом, выбранный нами инновационный путь играет важную роль в формировании форм воздействия. С другой стороны дальнейшее развитие различных форм деятельности требует от нас системного анализа модели развития?' },
                { id: 2, title: 'Название 2', body: 'Не следует, однако, забывать о том, что постоянное информационно-техническое обеспечение нашей деятельности обеспечивает широкому кругу специалистов участие в формировании экономической целесообразности принимаемых решений! Таким образом, выбранный нами инновационный путь играет важную роль в формировании форм воздействия. С другой стороны дальнейшее развитие различных форм деятельности требует от нас системного анализа модели развития?' },
                { id: 3, title: 'Название 3', body: 'Не следует, однако, забывать о том, что постоянное информационно-техническое обеспечение нашей деятельности обеспечивает широкому кругу специалистов участие в формировании экономической целесообразности принимаемых решений! Таким образом, выбранный нами инновационный путь играет важную роль в формировании форм воздействия. С другой стороны дальнейшее развитие различных форм деятельности требует от нас системного анализа модели развития?' },
                { id: 4, title: 'Название 4', body: 'Не следует, однако, забывать о том, что постоянное информационно-техническое обеспечение нашей деятельности обеспечивает широкому кругу специалистов участие в формировании экономической целесообразности принимаемых решений! Таким образом, выбранный нами инновационный путь играет важную роль в формировании форм воздействия. С другой стороны дальнейшее развитие различных форм деятельности требует от нас системного анализа модели развития?' },
            ],
            title: "",
            body: "",
            dialogVisible:false,
        }
    },
    methods: {
        createPost(post) {
            if (post.title != "" && post.body != "") {
                this.posts.push(post);
                this.dialogVisible = false;
            }
        },
        removePost(post) {
            this.posts = this.posts.filter(p => p.id !== post.id);
        },
        showDialog(){
            this.dialogVisible = true;
        }
    }
}
</script>

<style>
* {
    margin: 0;
    padding: 0;
    box-sizing: border-box;
}

.app {
    padding: 20px;
}
</style>